importando as bibliotecas

In [2]:
import pandas as pd

criando um dicionario

In [54]:
data = {
    'nome':['thiago','fabiana','luana','vinicius'],
    'sobrenome':['azevedo','fernandes','bianca','cavalcanti'],
    'idade':[41,42,21,17]
}

data

{'nome': ['thiago', 'fabiana', 'luana', 'vinicius'],
 'sobrenome': ['azevedo', 'fernandes', 'bianca', 'cavalcanti'],
 'idade': [41, 42, 21, 17]}

acessando o dicionario
obtendo a idade da primeira pessoa

In [55]:
data['idade'][0]

41

transformando data em dataframe

In [99]:
df = pd.DataFrame(data)
df

       nome   sobrenome  idade
0    thiago     azevedo     41
1   fabiana   fernandes     42
2     luana      bianca     21
3  vinicius  cavalcanti     17

acessando o dataframe
obs: cada coluna do dataframe e uma series

In [100]:
df['idade']

0    41
1    42
2    21
3    17
Name: idade, dtype: int64

In [58]:
type(df['idade'])

pandas.core.series.Series

acessando o dataframe especifico

In [59]:
df['idade'].iloc[0]

41

In [60]:
df['nome']

0      thiago
1     fabiana
2       luana
3    vinicius
Name: nome, dtype: object

In [61]:
df['sobrenome']

0       azevedo
1     fernandes
2        bianca
3    cavalcanti
Name: sobrenome, dtype: object

In [62]:
df['idade']

0    41
1    42
2    21
3    17
Name: idade, dtype: int64

In [63]:
df['idade'].iloc[1]

42

In [64]:
df['nome'].iloc[3]

'vinicius'

In [65]:
df['sobrenome'].iloc[3]

'cavalcanti'

In [66]:
df['idade'].iloc[2]

21

acessando uma linha especifica

In [67]:
df.iloc[0]sumario = df.describe()
sumario['nome']

nome          thiago
sobrenome    azevedo
idade             41
Name: 0, dtype: object

In [68]:
df.iloc[1]

nome           fabiana
sobrenome    fernandes
idade               42
Name: 1, dtype: object

In [69]:
df.iloc[2]

nome          luana
sobrenome    bianca
idade            21
Name: 2, dtype: object

In [70]:
df.iloc[3]

nome           vinicius
sobrenome    cavalcanti
idade                17
Name: 3, dtype: object

obs: a series pode ser obtida tanto pela coluna quanto numa linha
obs: os indices das series sao os nomes das colunas

In [71]:
type(df.iloc[0])

pandas.core.series.Series

diferencianco loc e iloc

In [72]:
df

       nome   sobrenome  idade
0    thiago     azevedo     41
1   fabiana   fernandes     42
2     luana      bianca     21
3  vinicius  cavalcanti     17

In [73]:
df.index = [3,2,1,0]

In [74]:
df

       nome   sobrenome  idade
3    thiago     azevedo     41
2   fabiana   fernandes     42
1     luana      bianca     21
0  vinicius  cavalcanti     17

In [75]:
df['idade'][0]

17

In [76]:
df['idade'].loc[0]#loc vai trazer o indice

17

In [77]:
df['idade'].iloc[0]#iloc vai trazer a posicao

41

saber o nome das colunas: colums
saber o nome das linhas: index

In [78]:
df

       nome   sobrenome  idade
3    thiago     azevedo     41
2   fabiana   fernandes     42
1     luana      bianca     21
0  vinicius  cavalcanti     17

In [79]:
df.index

Index([3, 2, 1, 0], dtype='int64')

In [80]:
df.columns

Index(['nome', 'sobrenome', 'idade'], dtype='object')

informacoes mais especificas

In [81]:
df

       nome   sobrenome  idade
3    thiago     azevedo     41
2   fabiana   fernandes     42
1     luana      bianca     21
0  vinicius  cavalcanti     17

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 3 to 0
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nome       4 non-null      object
 1   sobrenome  4 non-null      object
 2   idade      4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

buscando mais detalhes sobre a memoria usada

In [83]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 3 to 0
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nome       4 non-null      object
 1   sobrenome  4 non-null      object
 2   idade      4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 686.0 bytes

serie para exibir o tipo de cada coluna

In [84]:
df.dtypes

nome         object
sobrenome    object
idade         int64
dtype: object

obtendo as estatisticas descritivas (variaveis quantitativas)

In [85]:
df.describe()

           idade
count   4.000000
mean   30.250000
std    13.098982
min    17.000000
25%    20.000000
50%    31.000000
75%    41.250000
max    42.000000

atribuindo uma nova coluna

In [86]:
df['peso'] = [65,75,60,80]

In [87]:
df

       nome   sobrenome  idade  peso
3    thiago     azevedo     41    65
2   fabiana   fernandes     42    75
1     luana      bianca     21    60
0  vinicius  cavalcanti     17    80

In [88]:
df.describe()

           idade       peso
count   4.000000   4.000000
mean   30.250000  70.000000
std    13.098982   9.128709
min    17.000000  60.000000
25%    20.000000  63.750000
50%    31.000000  70.000000
75%    41.250000  76.250000
max    42.000000  80.000000

obtendo informacoes especificas

In [89]:
informacoes = df.describe()

In [90]:
informacoes['idade']['count']

4.0

In [91]:
informacoes['idade']['mean']

30.25

In [92]:
informacoes['idade']['std']

13.098982148752373

In [93]:
informacoes['idade']['min']

17.0

In [94]:
informacoes['idade']['25%']

20.0

head: mostar linhas especificas do dataframe 'de cima para baixo'

In [103]:
df.head(2)

      nome  sobrenome  idade
0   thiago    azevedo     41
1  fabiana  fernandes     42

tail: mostra linhas especificas do dataframe 'de baixo para cima'

In [102]:
df.tail(2)

       nome   sobrenome  idade
2     luana      bianca     21
3  vinicius  cavalcanti     17